{
    "title": "F. Copy of a Copy of a Copy",
    "timeLimit": {
        "value": 2.0,
        "unit": "seconds"
    },
    "memoryLimit": {
        "value": 256.0,
        "unit": "megabytes"
    },
    "statement": "<p>It all started with a black-and-white picture, that can be represented as an $$$n \\times m$$$ matrix such that all its elements are either $$$0$$$ or $$$1$$$. The rows are numbered from $$$1$$$ to $$$n$$$, the columns are numbered from $$$1$$$ to $$$m$$$.</p><p>Several operations were performed on the picture (possibly, zero), each of one of the two kinds: </p><ul> <li> choose a cell such that it's not on the border (neither row $$$1$$$ or $$$n$$$, nor column $$$1$$$ or $$$m$$$) and it's surrounded by four cells of the opposite color (four zeros if it's a one and vice versa) and paint it the opposite color itself; </li><li> make a copy of the current picture. </li></ul><p>Note that the order of operations could be arbitrary, they were not necessarily alternating.</p><p>You are presented with the outcome: all $$$k$$$ copies that were made. Additionally, you are given the initial picture. However, all $$$k+1$$$ pictures are shuffled.</p><p>Restore the sequence of the operations. If there are multiple answers, print any of them. The tests are constructed from the real sequence of operations, i. e. at least one answer always exists.</p>",
    "inputSpecification": "<p>The first line contains three integers $$$n, m$$$ and $$$k$$$ ($$$3 \\le n, m \\le 30$$$; $$$0 \\le k \\le 100$$$) — the number of rows and columns of the pictures and the number of copies made, respectively.</p><p>Then $$$k+1$$$ pictures follow — $$$k$$$ copies and the initial picture. Their order is arbitrary.</p><p>Each picture consists of $$$n$$$ lines, each consisting of $$$m$$$ characters, each character is either $$$0$$$ or $$$1$$$. <span class=\"tex-font-style-bf\">There is an empty line before each picture.</span></p>",
    "outputSpecification": "<p>In the first line, print a single integer — the index of the initial picture. The pictures are numbered from $$$1$$$ to $$$k+1$$$ in the order they appear in the input.</p><p>In the second line, print a single integer $$$q$$$ — the number of operations.</p><p>Each of the next $$$q$$$ lines should contain an operation. The operations should be listed in order they were applied. Each operation is one of two types: </p><ul> <li> $$$1$$$ $$$x$$$ $$$y$$$ — recolor a cell $$$(x, y)$$$ (the $$$y$$$-th cell in the $$$x$$$-th row, it should not be on the border and it should be surrounded by four cells of opposite color to itself); </li><li> $$$2$$$ $$$i$$$ — make a copy of the current picture and assign it index $$$i$$$ (picture with index the $$$i$$$ should be equal to the current picture). </li></ul><p>Each index from $$$1$$$ to $$$k+1$$$ should appear in the output exactly once — one of them is the index of the initial picture, the remaining $$$k$$$ are arguments of the operations of the second kind.</p><p>If there are multiple answers, print any of them. The tests are constructed from the real sequence of operations, i. e. at least one answer always exists.</p>",
    "samples": [
        {
            "input": "\n3 3 1\n\n010\n111\n010\n\n010\n101\n010\n",
            "output": "\n2\n2\n1 2 2\n2 1\n"
        },
        {
            "input": "\n4 5 3\n\n00000\n01000\n11100\n01000\n\n00000\n01000\n10100\n01000\n\n00000\n01010\n10100\n01000\n\n00000\n01000\n10100\n01000\n",
            "output": "\n3\n5\n1 2 4\n2 2\n2 4\n1 3 2\n2 1\n"
        },
        {
            "input": "\n5 3 0\n\n110\n010\n001\n011\n001\n",
            "output": "\n1\n0\n"
        }
    ],
    "note": null,
    "contestId": 1772,
    "index": "F",
    "name": "Copy of a Copy of a Copy",
    "type": "PROGRAMMING",
    "tags": [
        "constructive algorithms",
        "dfs and similar",
        "graphs",
        "implementation",
        "sortings"
    ],
    "solvedCount": 2257
}