{
    "title": "H. Hot and Cold",
    "timeLimit": {
        "value": 3.0,
        "unit": "seconds"
    },
    "memoryLimit": {
        "value": 1024.0,
        "unit": "megabytes"
    },
    "statement": "<p>This is an interactive problem.</p><p>After emigrating to another country, little Hanna came across the fact that playing \"Hot and cold\" became more difficult: she does not understand the hint phrases! You are to write a helping program for her.</p><p>The playground where the game happens is a rectangle, and the treasure is hidden in some point with integer coordinates between 0 and $$$10^6$$$, inclusive. Hanna visits several points with valid coordinates. If the visited point contains the hidden treasure, she receives the phrase \"Found!\" in the local language. Fortunately, the intonations allow her to recognize this phrase — in this problem it will be denoted by an exclamation mark.</p><p>Otherwise, for each visited point except for the first one, Hanna receives a phrase in the local language stating whether she is now \"Closer\", \"Further\", or \"At the same distance\" from the treasure, compared to the previous point. The distances are measured in Euclidean metric. After the first visited point, in case of no treasure there, Hanna receives the phrase \"Not found\" in the local language.</p><p>Your program must help Hanna find the treasure by visiting <span class=\"tex-font-style-bf\">at most 64 points</span>.</p>",
    "inputSpecification": null,
    "outputSpecification": null,
    "samples": [
        {
            "input": "\n\nTabilmadi\n\nDaha yakin\n\nDaha yakin\n\nSama distanco\n\nDalej\n\nZnaydeno!",
            "output": "\n500 200\n\n560 230\n\n566 240\n\n566 238\n\n30 239\n\n566 239"
        },
        {
            "input": "\n\nYou are lucky today!\n",
            "output": "\n777777 777777\n"
        }
    ],
    "note": null,
    "contestId": 1773,
    "index": "H",
    "name": "Hot and Cold",
    "type": "PROGRAMMING",
    "tags": [
        "binary search",
        "interactive"
    ],
    "solvedCount": 346
}