{
    "title": "B. Scrambled",
    "timeLimit": {
        "value": 2.0,
        "unit": "seconds"
    },
    "memoryLimit": {
        "value": 64.0,
        "unit": "megabytes"
    },
    "statement": "<p>Btoh yuo adn yuor roomatme lhoate wianshg disehs, btu stlil sdmoeboy msut peorrfm tihs cohre dialy. Oen dya yuo decdie to idourtcne smoe syestm. Yuor rmmotaoe sstgegus teh fooniwllg dael. Yuo argee on tow arayrs of ientgres M adn R, nmebur upmicnog dyas (induiclng teh cunrret oen) wtih sicsescuve irnegets (teh ceurrnt dya is zreo), adn yuo wsah teh diehss on dya D if adn olny if terhe etsixs an iednx i scuh taht <span class=\"tex-span\"><i>D</i> <i>mod</i> <i>M</i>[<i>i</i>] = <i>R</i>[<i>i</i>]</span>, otwsehrie yuor rmootmae deos it. Yuo lkie teh cncepot, btu yuor rmotaome's cuinnng simle meaks yuo ssecupt sthnoemig, so yuo itennd to vefriy teh fnerisas of teh aemnrgeet.</p><p>Yuo aer geivn ayarrs M adn R. Cuaclatle teh pceanregte of dyas on wchih yuo edn up dnoig teh wisahng. Amsuse taht yuo hvae iiiftlneny mnay dyas aehad of yuo. </p>",
    "inputSpecification": "<p>The first line of input contains a single integer N (<span class=\"tex-span\">1 ≤ <i>N</i> ≤ 16</span>).</p><p>The second and third lines of input contain N integers each, all between 0 and 16, inclusive, and represent arrays M and R, respectively. All <span class=\"tex-span\"><i>M</i>[<i>i</i>]</span> are positive, for each <span class=\"tex-span\"><i>i</i></span> <span class=\"tex-span\"><i>R</i>[<i>i</i>] &lt; <i>M</i>[<i>i</i>]</span>.</p>",
    "outputSpecification": "<p>Output a single real number. The answer is considered to be correct if its absolute or relative error does not exceed <span class=\"tex-span\">10<sup class=\"upper-index\"> - 4</sup></span>.</p>",
    "samples": [
        {
            "input": "1<br/>2<br/>0<br/>",
            "output": "0.500000<br/>"
        },
        {
            "input": "2<br/>2 3<br/>1 0<br/>",
            "output": "0.666667<br/>"
        }
    ],
    "note": null,
    "contestId": 656,
    "index": "B",
    "name": "Scrambled",
    "type": "PROGRAMMING",
    "tags": [
        "*special",
        "implementation"
    ],
    "solvedCount": 1636
}