{
    "title": "G. Visible Black Areas",
    "timeLimit": {
        "value": 1.0,
        "unit": "second"
    },
    "memoryLimit": {
        "value": 256.0,
        "unit": "megabytes"
    },
    "statement": "<p>Petya has a polygon consisting of $$$n$$$ vertices. All sides of the Petya's polygon are parallel to the coordinate axes, and each two adjacent sides of the Petya's polygon are perpendicular. It is guaranteed that the polygon is simple, that is, it doesn't have self-intersections and self-touches. All internal area of the polygon (borders are not included) was painted in black color by Petya.</p><p>Also, Petya has a rectangular window, defined by its coordinates, through which he looks at the polygon. A rectangular window can not be moved. The sides of the rectangular window are parallel to the coordinate axes.</p><center> <img class=\"tex-graphics\" src=\"https://espresso.codeforces.com/eaac2c311fdd795a1631b2ac39549ec329bec632.png\" style=\"max-width: 100.0%;max-height: 100.0%;\"/> <span class=\"tex-font-size-small\">Blue color represents the border of a polygon, red color is the Petya's window. The answer in this case is 2.</span> </center><p>Determine the number of black connected areas of Petya's polygon, which can be seen through the rectangular window.</p>",
    "inputSpecification": "<p>The first line contain four integers $$$x_1, y_1, x_2, y_2$$$ ($$$x_1 &lt; x_2$$$, $$$y_2 &lt; y_1$$$) — the coordinates of top-left and bottom-right corners of the rectangular window. </p><p>The second line contains a single integer $$$n$$$ ($$$4 \\le n \\le 15\\,000$$$) — the number of vertices in Petya's polygon.</p><p>Each of the following $$$n$$$ lines contains two integers — the coordinates of vertices of the Petya's polygon in counterclockwise order. Guaranteed, that the given polygon satisfies the conditions described in the statement.</p><p>All coordinates of the rectangular window and all coordinates of the vertices of the polygon are non-negative and do not exceed $$$15\\,000$$$.</p>",
    "outputSpecification": "<p>Print the number of black connected areas of Petya's polygon, which can be seen through the rectangular window.</p>",
    "samples": [
        {
            "input": "5 7 16 3<br/>16<br/>0 0<br/>18 0<br/>18 6<br/>16 6<br/>16 1<br/>10 1<br/>10 4<br/>7 4<br/>7 2<br/>2 2<br/>2 6<br/>12 6<br/>12 12<br/>10 12<br/>10 8<br/>0 8<br/>",
            "output": "2"
        }
    ],
    "note": "<p>The example corresponds to the picture above.</p>",
    "contestId": 962,
    "index": "G",
    "name": "Visible Black Areas",
    "type": "PROGRAMMING",
    "tags": [
        "data structures",
        "dsu",
        "geometry",
        "trees"
    ],
    "solvedCount": 126
}