{
    "title": "K. Kingdom of Islands",
    "timeLimit": {
        "value": 2.0,
        "unit": "seconds"
    },
    "memoryLimit": {
        "value": 1024.0,
        "unit": "megabytes"
    },
    "statement": "<p>The Kingdom of Islands consists of $$$p$$$ islands. As the king, you rule over the whole kingdom, while each island is ruled over by one or several jarls under your rule. In total, there are $$$n$$$ jarls under your jurisdiction.</p><p>Each island of the kingdom has its own strong traditions, so jarls that rule over the same island support each other and never have conflicts. The downsides of such strength are cultural conflicts between people inhabiting different islands. Thus, two jarls that rule over different islands are in conflict.</p><p>However, recent years brought a few changes to traditional relations between the jarls. To your knowledge, there are exactly $$$k$$$ pairs of jarls such that relationships between two jarls in the pair are different from the traditional. That is, if two jarls of the pair you know rule over the same island, these jarls are in conflict. If they rule over different islands, then they overcome cultural disagreement and there is no conflict between them anymore.</p><p>As a true responsible king, you are worried about whether the kingdom is close to a major conflict. In order to estimate the current situation, you would like to find the largest possible group of jarls such that every two jarls in the group are in conflict.</p>",
    "inputSpecification": "<p>The first line of the input consists of two integers $$$p$$$ and $$$n$$$ ($$$1 \\le p \\le n \\le 10^5$$$; $$$1 \\le p \\le 10^4$$$).</p><p>The second line consists of $$$n$$$ integers $$$s_1, s_2, \\ldots, s_n$$$ ($$$1 \\le s_i \\le p$$$). The integer $$$s_i$$$ denotes that the $$$i$$$-th jarl rules over the island number $$$s_i$$$. It is guaranteed that each island is ruled by at least one jarl.</p><p>The third line consists of a single integer $$$k$$$ ($$$0 \\le k \\le 20$$$).</p><p>Then $$$k$$$ lines follow. The $$$j$$$-th of these lines consists of two distinct integers $$$a_j$$$ and $$$b_j$$$ ($$$1 \\le a_j &lt; b_j \\le n$$$), denoting that the relation between the $$$a_j$$$-th jarl and the $$$b_j$$$-th jarl differs from traditional. It is guaranteed that no pair of jarls appears twice in this list.</p>",
    "outputSpecification": "<p>In the first line print a single integer $$$q$$$ between $$$1$$$ and $$$n$$$ — the largest possible number of jarls in a pairwise conflicting group. In the second line print $$$q$$$ distinct integers between $$$1$$$ and $$$n$$$ — the numbers of jarls in the group. The numbers of jarls can be printed in any order.</p>",
    "samples": [
        {
            "input": "\n4 4\n1 2 3 4\n1\n2 3\n",
            "output": "\n3\n1 4 2 "
        },
        {
            "input": "\n2 4\n1 1 2 2\n1\n3 4\n",
            "output": "\n3\n2 4 3 "
        },
        {
            "input": "\n4 8\n1 1 1 2 2 3 4 4\n7\n1 2\n2 3\n3 6\n4 5\n5 7\n2 7\n3 8\n",
            "output": "\n6\n8 6 5 4 2 1 "
        }
    ],
    "note": "<p>The conflict graph for the last sample testcase is given below. Each circle represents an island. </p><center> <img class=\"tex-graphics\" src=\"https://espresso.codeforces.com/28858854800dd0795d0db517d4e7c7484a8065bc.png\" style=\"max-width: 100.0%;max-height: 100.0%;\" width=\"378px\"/> </center>",
    "contestId": 1578,
    "index": "K",
    "name": "Kingdom of Islands",
    "type": "PROGRAMMING",
    "tags": [
        "brute force",
        "graphs",
        "implementation"
    ],
    "solvedCount": 347
}