{
    "title": "E. Triangles",
    "timeLimit": {
        "value": 1.0,
        "unit": "second"
    },
    "memoryLimit": {
        "value": 64.0,
        "unit": "megabytes"
    },
    "statement": "<p>Last summer Peter was at his granny's in the country, when a wolf attacked sheep in the nearby forest. Now he fears to walk through the forest, to walk round the forest, even to get out of the house. He explains this not by the fear of the wolf, but by a strange, in his opinion, pattern of the forest that has <span class=\"tex-span\"><i>n</i></span> levels, where <span class=\"tex-span\"><i>n</i></span> is an even number.</p><p>In the local council you were given an area map, where the granny's house is marked by point <span class=\"tex-span\"><i>H</i></span>, parts of dense forest are marked grey (see the picture to understand better).</p><p>After a long time at home Peter decided to yield to his granny's persuasions and step out for a breath of fresh air. Being prudent, Peter plans the route beforehand. The route, that Peter considers the most suitable, has the following characteristics: </p><ul> <li> it starts and ends in the same place — the granny's house; </li><li> the route goes along the forest paths only (these are the segments marked black in the picture); </li><li> the route has positive length (to step out for a breath of fresh air Peter has to cover some distance anyway); </li><li> the route cannot cross itself; </li><li> there shouldn't be any part of dense forest within the part marked out by this route; </li></ul><p>You should find the amount of such suitable oriented routes modulo 1000000009.</p><center> <img class=\"tex-graphics\" src=\"https://espresso.codeforces.com/9679343214ebd807266023bbdf5dc0c622c2e808.png\" style=\"max-width: 100.0%;max-height: 100.0%;\"/> </center><p>The example of the area map for <span class=\"tex-span\"><i>n</i> = 12</span> is given in the picture. Since the map has a regular structure, you can construct it for other <span class=\"tex-span\"><i>n</i></span> by analogy using the example.</p>",
    "inputSpecification": "<p>The input data contain the only even integer <span class=\"tex-span\"><i>n</i></span> (<span class=\"tex-span\">2 ≤ <i>n</i> ≤ 10<sup class=\"upper-index\">6</sup></span>).</p>",
    "outputSpecification": "<p>Output the only number — the amount of Peter's routes modulo 1000000009.</p>",
    "samples": [
        {
            "input": "2<br/>",
            "output": "10<br/>"
        },
        {
            "input": "4<br/>",
            "output": "74<br/>"
        }
    ],
    "note": null,
    "contestId": 15,
    "index": "E",
    "name": "Triangles",
    "type": "PROGRAMMING",
    "tags": [
        "combinatorics",
        "dp"
    ],
    "solvedCount": 561
}