{
    "title": "E2. The Beaver's Problem - 2",
    "timeLimit": {
        "value": 5.0,
        "unit": "seconds"
    },
    "memoryLimit": {
        "value": 256.0,
        "unit": "megabytes"
    },
    "statement": "<p>Offering the ABBYY Cup participants a problem written by the Smart Beaver is becoming a tradition. He proposed the following problem.</p><p>You are given a monochrome image, that is, an image that is composed of two colors (black and white). The image is given in raster form, that is, as a matrix of pixels' colors, and the matrix's size coincides with the size of the image.</p><p>The white color on the given image corresponds to the background. Also, the image contains several black geometric shapes. It is known that the image can contain only two types of shapes: squares and circles. Your task is to count the number of circles and the number of squares which the given image contains.</p><p>The squares on the image can be rotated arbitrarily. In addition, the image can possibly contain some noise arranged as follows: each pixel of the original image can change its color to the opposite with the probability of <span class=\"tex-span\">20</span>%.</p><center> <img class=\"tex-graphics\" src=\"https://espresso.codeforces.com/a7c69f67deddeaed14cc1cc9edbf4d8a3133ab6b.png\" style=\"max-width: 100.0%;max-height: 100.0%;\"/> <span class=\"tex-font-size-script\"> An example of an image that has no noise and the sides of the squares are parallel to the coordinate axes (two circles and three squares). </span> </center><center> <img class=\"tex-graphics\" src=\"https://espresso.codeforces.com/39c019e490c44909977fc5dd9b84a0a37fdfa50b.png\" style=\"max-width: 100.0%;max-height: 100.0%;\"/> <span class=\"tex-font-size-script\"> An example of an image that has no noise and the squares are rotated arbitrarily (two circles and three squares). </span> </center><center> <img class=\"tex-graphics\" src=\"https://espresso.codeforces.com/9c4960fbaced04ee5f74007f33ee543d83c23ad2.png\" style=\"max-width: 100.0%;max-height: 100.0%;\"/> <span class=\"tex-font-size-script\"> An example of an image that has noise and the squares are rotated arbitrarily (one circle and three squares). </span> </center>",
    "inputSpecification": "<p>The first input line contains a single integer <span class=\"tex-span\"><i>n</i></span> (<span class=\"tex-span\">1000 ≤ <i>n</i> ≤ 2000</span>), which is the length and the width of the original image. </p><p>Next <span class=\"tex-span\"><i>n</i></span> lines describe the matrix of colors of the image pixels. The <span class=\"tex-span\"><i>i</i></span>-th line contains exactly <span class=\"tex-span\"><i>n</i></span> integers <span class=\"tex-span\"><i>a</i><sub class=\"lower-index\"><i>ij</i></sub></span> (<span class=\"tex-span\">0 ≤ <i>a</i><sub class=\"lower-index\"><i>ij</i></sub> ≤ 1</span>), separated by spaces. Value of <span class=\"tex-span\"><i>a</i><sub class=\"lower-index\"><i>ij</i></sub> = 0</span> corresponds to a white pixel and <span class=\"tex-span\"><i>a</i><sub class=\"lower-index\"><i>ij</i></sub> = 1</span> corresponds to a black one. </p><p>It is guaranteed that the lengths of the sides of the squares and the diameters of the circles in the image are at least 15 pixels, and the distance between any two figures is at least 10 pixels. It is also guaranteed that a human can easily calculate the number of circles and squares in the original image. The total number of figures in the image doesn't exceed 50.</p><p>The input limitations for getting 20 points are: </p><ul> <li> These test cases have no noise and the sides of the squares are parallel to the coordinate axes. </li></ul><p>The input limitations for getting 50 points are: </p><ul> <li> These test cases have no noise, but the squares are rotated arbitrarily. </li></ul><p>The input limitations for getting 100 points are: </p><ul> <li> These test cases have noise and the squares are rotated arbitrarily. </li></ul>",
    "outputSpecification": "<p>Print exactly two integers, separated by a single space — the number of circles and the number of squares in the given image, correspondingly.</p>",
    "samples": [],
    "note": "<p>You are given a sample of original data for each difficulty level. The samples are available at <span class=\"tex-font-style-tt\">http://codeforces.com/static/materials/contests/178/e-samples.zip</span> .</p>",
    "contestId": 178,
    "index": "E2",
    "name": "The Beaver's Problem - 2",
    "type": "PROGRAMMING",
    "tags": [],
    "solvedCount": 227
}