{
    "title": "H. Table Bowling",
    "timeLimit": {
        "value": 2.0,
        "unit": "seconds"
    },
    "memoryLimit": {
        "value": 64.0,
        "unit": "megabytes"
    },
    "statement": "<p>Table bowling tournament participant completed the competition according to the given final standings table. The table is given as a sequence of lines, each line has a format \"name score\". Your task is to prepare another table consisting of lines in the form \"place name\". Sort participant by score (desc.) and by the name lexicographically in the case of a tie. Places are numerated from 1. If more than one participant has some score, all of them share the places and you should output something like \"12-14 john\".</p><p>Please, look into the samples for clarification.</p>",
    "inputSpecification": "<p>The first line contains <span class=\"tex-span\"><i>n</i></span> (<span class=\"tex-span\">1 ≤ <i>n</i> ≤ 100</span>) — the number of rows in the table. Following <span class=\"tex-span\"><i>n</i></span> lines contain the given table. Each line has the form \"name score\", where \"name\" is a sequence of lowercase Latin letters, and \"score\" — is an integer number between 0 and 1000, inclusive. All the names are distinct. The length of each name is between 1 and 10 characters, inclusive. There is single space between the name and the score in each line.</p>",
    "outputSpecification": "<p>Print the required table. Look at the sample outputs for clarifications.</p>",
    "samples": [
        {
            "input": "5<br/>vasya 10<br/>ted 11<br/>petya 10<br/>katya 33<br/>mike 44<br/>",
            "output": "1 mike<br/>2 katya<br/>3 ted<br/>4-5 petya<br/>4-5 vasya<br/>"
        },
        {
            "input": "3<br/>a 1<br/>b 13<br/>c 1<br/>",
            "output": "1 b<br/>2-3 a<br/>2-3 c<br/>"
        }
    ],
    "note": null,
    "contestId": 64,
    "index": "H",
    "name": "Table Bowling",
    "type": "PROGRAMMING",
    "tags": [
        "*special",
        "sortings"
    ],
    "solvedCount": 111
}