{
    "title": "A1. Death Stars (easy)",
    "timeLimit": {
        "value": 1.0,
        "unit": "second"
    },
    "memoryLimit": {
        "value": 256.0,
        "unit": "megabytes"
    },
    "statement": "<p>The stardate is 1977 and the science and art of detecting Death Stars is in its infancy. Princess Heidi has received information about the stars in the nearby solar system from the Rebel spies and now, to help her identify the exact location of the Death Star, she needs to know whether this information is correct. </p><p>Two rebel spies have provided her with the maps of the solar system. Each map is an <span class=\"tex-span\"><i>N</i> × <i>N</i></span> grid, where each cell is either occupied by a star or empty. To see whether the information is correct, Heidi needs to know whether the two maps are of the same solar system, or if possibly one of the spies is actually an Empire double agent, feeding her false information.</p><p>Unfortunately, spies may have accidentally rotated a map by 90, 180, or 270 degrees, or flipped it along the vertical or the horizontal axis, before delivering it to Heidi. If Heidi can rotate or flip the maps so that two of them become identical, then those maps are of the same solar system. Otherwise, there are traitors in the Rebel ranks! Help Heidi find out.</p>",
    "inputSpecification": "<p>The first line of the input contains one number <span class=\"tex-span\"><i>N</i></span> (<span class=\"tex-span\">1 ≤ <i>N</i> ≤ 10</span>) – the dimension of each map. Next <span class=\"tex-span\"><i>N</i></span> lines each contain <span class=\"tex-span\"><i>N</i></span> characters, depicting the first map: 'X' indicates a star, while 'O' indicates an empty quadrant of space. Next <span class=\"tex-span\"><i>N</i></span> lines each contain <span class=\"tex-span\"><i>N</i></span> characters, depicting the second map in the same format.</p>",
    "outputSpecification": "<p>The only line of output should contain the word <span class=\"tex-font-style-tt\">Yes</span> if the maps are identical, or <span class=\"tex-font-style-tt\">No</span> if it is impossible to match them by performing rotations and translations.</p>",
    "samples": [
        {
            "input": "4<br/>XOOO<br/>XXOO<br/>OOOO<br/>XXXX<br/>XOOO<br/>XOOO<br/>XOXO<br/>XOXX<br/>",
            "output": "Yes<br/>"
        },
        {
            "input": "2<br/>XX<br/>OO<br/>XO<br/>OX<br/>",
            "output": "No<br/>"
        }
    ],
    "note": "<p>In the first test, you can match the first map to the second map by first flipping the first map along the vertical axis, and then by rotating it 90 degrees clockwise.</p><p> </p>",
    "contestId": 958,
    "index": "A1",
    "name": "Death Stars (easy)",
    "type": "PROGRAMMING",
    "tags": [
        "implementation"
    ],
    "solvedCount": 1637
}